In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('DataClean.csv')

In [3]:
print(df)

          Status Age Group    Education    Industry   Location   AI Risk  \
0       EMPLOYED     25_34  high school  Technology      Urban       NaN
1       EMPLOYED     18-24      Diploma     Fintech      rural  moderate
2       EMPLOYED     25_34  High School      Retail      Delhi       Low
3     UNEMPLOYED     18-24      Masters      Retail      Urban       Low
4            NaN     45-54      Diploma     Fintech  Hyderabad       low
...          ...       ...          ...         ...        ...       ...
1995    employed     25-34         Ph.D     Finance  Hyderabad       Low
1996    EMPLOYED     25-34          PhD       Tech         NaN       NaN
1997         NaN   35 - 44      Masters   Education        NaN       low
1998    EMPLOYED     25_34  high school      Retail     Mumbai      HIGH
1999  UNEMPLOYED     25_34  High School         NaN        NaN  moderate

      Years of Experience  Monthly Salary (INR) Date Recorded
0                     NaN               40700.0    01-01-2023
1                     NaN               17500.0    01-02-2023
2                    16.0               77600.0    01-03-2023
3                    30.0              100200.0    01-04-2023
4                     9.0               19500.0    01-05-2023
...                   ...                   ...           ...
1995                  NaN              113000.0     6/18/2028
1996                 22.0              102200.0     6/19/2028
1997                  NaN               31600.0     6/20/2028
1998                 22.0               92500.0     6/21/2028
1999                  NaN               43300.0     6/22/2028

[2000 rows x 9 columns]

In [4]:
df.columns.str.lower()

Index(['status', 'age group', 'education', 'industry', 'location', 'ai risk',
       'years of experience', 'monthly salary (inr)', 'date recorded'],
      dtype='object')

In [5]:
df.columns.str.replace(' ','_')

Index(['Status', 'Age_Group', 'Education', 'Industry', 'Location', 'AI_Risk',
       'Years_of_Experience', 'Monthly_Salary_(INR)', 'Date_Recorded'],
      dtype='object')

In [6]:
df.columns = df.columns.str.lower().str.replace(' ','_')

In [7]:
print(df.columns)

Index(['status', 'age_group', 'education', 'industry', 'location', 'ai_risk',
       'years_of_experience', 'monthly_salary_(inr)', 'date_recorded'],
      dtype='object')

In [12]:
df['status'] = df['status'].str.lower().str.replace('employed','1').str.replace('un1','0')
df['status']

0         1
1         1
2         1
3         0
4       NaN
       ...
1995      1
1996      1
1997    NaN
1998      1
1999      0
Name: status, Length: 2000, dtype: object

In [13]:
df['age_group'].unique()

array(['25_34', '18-24', '45-54', '35 - 44', '55+', '25-34', '18 to 24',
       nan], dtype=object)

In [14]:
df['age_group'] = df['age_group'].str.replace('_','-').str.replace(' - ','-').str.replace('+','-100').str.replace(' to ','-')
df

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
0,1,25-34,high school,Technology,Urban,NaN,NaN,40700.0,01-01-2023
1,1,18-24,Diploma,Fintech,rural,moderate,NaN,17500.0,01-02-2023
2,1,25-34,High School,Retail,Delhi,Low,16.0,77600.0,01-03-2023
3,0,18-24,Masters,Retail,Urban,Low,30.0,100200.0,01-04-2023
4,NaN,45-54,Diploma,Fintech,Hyderabad,low,9.0,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...,...
1995,1,25-34,Ph.D,Finance,Hyderabad,Low,NaN,113000.0,6/18/2028
1996,1,25-34,PhD,Tech,NaN,NaN,22.0,102200.0,6/19/2028
1997,NaN,35-44,Masters,Education,NaN,low,NaN,31600.0,6/20/2028
1998,1,25-34,high school,Retail,Mumbai,HIGH,22.0,92500.0,6/21/2028
1999,0,25-34,High School,NaN,NaN,moderate,NaN,43300.0,6/22/2028

In [15]:
df['education'].unique()

array(['high school', 'Diploma', 'High School', 'Masters', 'PhD',
       'Master', 'Ph.D', 'Bachelors', nan, "Bachelor's"], dtype=object)

In [16]:
df['education'] = df['education'].str.lower()
df

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
0,1,25-34,high school,Technology,Urban,NaN,NaN,40700.0,01-01-2023
1,1,18-24,diploma,Fintech,rural,moderate,NaN,17500.0,01-02-2023
2,1,25-34,high school,Retail,Delhi,Low,16.0,77600.0,01-03-2023
3,0,18-24,masters,Retail,Urban,Low,30.0,100200.0,01-04-2023
4,NaN,45-54,diploma,Fintech,Hyderabad,low,9.0,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...,...
1995,1,25-34,ph.d,Finance,Hyderabad,Low,NaN,113000.0,6/18/2028
1996,1,25-34,phd,Tech,NaN,NaN,22.0,102200.0,6/19/2028
1997,NaN,35-44,masters,Education,NaN,low,NaN,31600.0,6/20/2028
1998,1,25-34,high school,Retail,Mumbai,HIGH,22.0,92500.0,6/21/2028
1999,0,25-34,high school,NaN,NaN,moderate,NaN,43300.0,6/22/2028

In [17]:
df['education'].unique()

array(['high school', 'diploma', 'masters', 'phd', 'master', 'ph.d',
       'bachelors', nan, "bachelor's"], dtype=object)

In [18]:
df['education'] = df['education'].str.replace(' ','_').str.replace('masters','master').str.replace('.','').str.replace('bachelors','bachelor').str.replace("'s","")
df['education']

0       high_school
1           diploma
2       high_school
3            master
4           diploma
           ...
1995            phd
1996            phd
1997         master
1998    high_school
1999    high_school
Name: education, Length: 2000, dtype: object

In [19]:
df['education'].unique()

array(['high_school', 'diploma', 'master', 'phd', 'bachelor', nan],
      dtype=object)

In [20]:
df['industry'] = df['industry'].str.lower()

In [21]:
df['industry'].unique()

array(['technology', ' fintech', 'retail', 'tech ', nan, 'health',
       'healthcare', 'education', 'finance'], dtype=object)

In [23]:
df['industry'] = df['industry'].str.replace('technology','tech').str.replace('healthcare','health')
df['industry'].unique()

array(['tech', ' fintech', 'retail', 'tech ', nan, 'health', 'education',
       'finance'], dtype=object)

In [24]:
df['location'].unique()

array(['Urban', 'rural', 'Delhi', 'Hyderabad', 'Bangalore', 'Mumbai', nan,
       'urban', 'suburban', 'delhi'], dtype=object)

In [26]:
df['location'] = df['location'].str.lower().str.replace('delhi','urban').str.replace('hyderabad','urban').str.replace('bangalore','urban').str.replace('mumbai','urban')
df['location'].unique()

The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.

array(['urban', 'rural', nan, 'suburban'], dtype=object)

In [27]:
df['ai_risk'].unique()

array([nan, 'moderate', 'Low', 'low', 'HIGH', 'Medium', 'High'],
      dtype=object)

In [28]:
df['ai_risk'] = df['ai_risk'].str.lower().str.replace('moderate','medium')
df['ai_risk'].unique()

array([nan, 'medium', 'low', 'high'], dtype=object)

In [29]:
df['years_of_experience'].unique()

array([nan, 16., 30.,  9., 20., 28.,  0.,  3., 18.,  6.,  5., 24., 12.,
       22., 15.,  2.,  8., 25., 10.,  1., 11.,  4., 17.,  7., 27., 26.,
       21., 23., 19., 29., 14., 13.])

In [33]:
df['years_of_experience'] = df['years_of_experience'].fillna(0)

In [34]:
df

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
0,1,25-34,high_school,tech,urban,NaN,0.0,40700.0,01-01-2023
1,1,18-24,diploma,fintech,rural,medium,0.0,17500.0,01-02-2023
2,1,25-34,high_school,retail,urban,low,16.0,77600.0,01-03-2023
3,0,18-24,master,retail,urban,low,30.0,100200.0,01-04-2023
4,NaN,45-54,diploma,fintech,urban,low,9.0,19500.0,01-05-2023
...,...,...,...,...,...,...,...,...,...
1995,1,25-34,phd,finance,urban,low,0.0,113000.0,6/18/2028
1996,1,25-34,phd,tech,NaN,NaN,22.0,102200.0,6/19/2028
1997,NaN,35-44,master,education,NaN,low,0.0,31600.0,6/20/2028
1998,1,25-34,high_school,retail,urban,high,22.0,92500.0,6/21/2028
1999,0,25-34,high_school,NaN,NaN,medium,0.0,43300.0,6/22/2028

In [44]:
df.dropna()

,status,age_group,education,industry,location,ai_risk,years_of_experience,monthly_salary_(inr),date_recorded
1,1,18-24,diploma,fintech,rural,medium,0.0,17500.0,02-01-23
2,1,25-34,high_school,retail,urban,low,16.0,77600.0,03-01-23
3,0,18-24,master,retail,urban,low,30.0,100200.0,04-01-23
5,0,25-34,phd,tech,urban,high,0.0,54500.0,06-01-23
11,0,45-54,high_school,tech,urban,high,0.0,27000.0,12-01-23
...,...,...,...,...,...,...,...,...,...
1988,1,25-34,phd,health,urban,medium,26.0,49200.0,11-06-28
1990,0,18-24,phd,health,rural,medium,19.0,146200.0,13-06-28
1994,0,55-100,bachelor,education,urban,low,0.0,9000.0,17-06-28
1995,1,25-34,phd,finance,urban,low,0.0,113000.0,18-06-28
1998,1,25-34,high_school,retail,urban,high,22.0,92500.0,21-06-28

In [45]:
df['date_recorded'] = df['date_recorded'].str.replace('/','-')
df['date_recorded'] = pd.to_datetime(df['date_recorded'], format='%m-%d-%Y')
df['date_recorded'] = df['date_recorded'].dt.strftime('%d-%m-%y')
df

/var/folders/02/srb2fnrs669c482y2nd5t01w0000gn/T/ipykernel_4459/441010442.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['date_recorded'] = df['date_recorded'].str.replace('/','-')

ValueError: time data "02-01-23" doesn't match format "%m-%d-%Y", at position 0. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.